fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УсловноеОформление();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	РассчитатьКоличествоДней();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	РассчитатьКоличествоДней();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УсловноеОформление();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьКоличествоДней()
	
	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекДанные.ДатаОкончания) Или Не ЗначениеЗаполнено(ТекДанные.ДатаНачала) Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.ДнейОтпуска = (ТекДанные.ДатаОкончания - ТекДанные.ДатаНачала) / 86400 + 1;
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформление()
	
	ТЗ = Объект.ОтпускаСотрудников.Выгрузить(, "Сотрудник, ДнейОтпуска");
	ТЗ.Свернуть("Сотрудник", "ДнейОтпуска");
	
	Для Каждого Строка Из ТЗ Цикл
		
		Если Строка.ДнейОтпуска <= 28 Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("Сотрудник", Строка.Сотрудник);
		
		НайденныеСтроки = Объект.ОтпускаСотрудников.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
			
			ЭлементОформления = УсловноеОформление.Элементы.Добавить();
			ЭлементОформления.Использование = Истина; 
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноКрасноФиолетовый);
			
			ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник"); 
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;	 
			ЭлементУсловия.ПравоеЗначение = Строка.Сотрудник;
			ЭлементУсловия.Использование = Истина; 
			
			ЭлементПоле = ЭлементОформления.Поля.Элементы.Добавить();
			ЭлементПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
		КонецЦикла;
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда) 
	
	МассивДанных = Новый Массив;
	
	//МассивДанных.Добавить(Объект.Год);
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		
		ДанныеСтроки = Новый Структура;
		
		ДанныеСтроки.Вставить("Сотрудник", Строка.Сотрудник);
		ДанныеСтроки.Вставить("ДатаНачала", Строка.ДатаНачала);
		ДанныеСтроки.Вставить("ДатаОкончания", Строка.ДатаОкончания);

		МассивДанных.Добавить(ДанныеСтроки);
		
	КонецЦикла;
	
	Адрес = ПоместитьВоВременноеХранилище(МассивДанных, УникальныйИдентификатор);
	
	Парам = Новый Структура;
	Парам.Вставить("Адрес", Адрес); 
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализаГрафика", Парам, ЭтотОбъект, УникальныйИдентификатор);	

КонецПроцедуры


#КонецОбласти
